# Read and write CSV and XLS files

In [2]:
import pandas as pd
df = pd.read_csv('weather_data.csv')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [4]:
#INSTALL: pip3 install xlrd

#read excel file 
df = pd.read_excel('weather_data.xlsx')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [18]:
df["City"] = "Muasfasdm"

In [20]:
df["qun"] = [1,2,3,4,6,3,4]
df["price"] = [1,2,3,4,5,6]

ValueError: Length of values (5) does not match length of index (6)

In [14]:
df

        day  temperature  windspeed  event City  qun  price  Sub
0  1/1/2017           32          6   Rain  Mum    1      1   15
1  1/2/2017           35          7  Sunny  Mum    2      2   15
2  1/3/2017           28          2   Snow  Mum    3      3   15
3  1/4/2017           24          7   Snow  Mum    4      4   15
4  1/5/2017           32          4   Rain  Mum    5      5   15
5  1/6/2017           31          2  Sunny  Mum    6      6   15

In [15]:
df["Sub"] = df["qun"]  * df["price"]

In [19]:
df

        day  temperature  windspeed  event       City  qun  price  Sub
0  1/1/2017           32          6   Rain  Muasfasdm    1      1    1
1  1/2/2017           35          7  Sunny  Muasfasdm    2      2    4
2  1/3/2017           28          2   Snow  Muasfasdm    3      3    9
3  1/4/2017           24          7   Snow  Muasfasdm    4      4   16
4  1/5/2017           32          4   Rain  Muasfasdm    5      5   25
5  1/6/2017           31          2  Sunny  Muasfasdm    6      6   36

In [17]:
#write DF to csv
df.to_csv('new.csv') 
df.to_csv('new_noIndex.csv', index=False)

In [ ]:
# INSTALL: pip3 install openpyxl

#write DF to Excel
df.to_excel('new.xlsx', sheet_name='weather_data')

# GROUP-BY

In [21]:
import pandas as pd
df = pd.read_csv('weather_data_cities.csv')
df #weather by cities

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [22]:
g = df.groupby('city')
g

In [30]:
for i, j in g:
    print(i)
    print(j)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [24]:
#or to get specific group
g.get_group('new york')

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [25]:
#Find maximum temperature in each of the cities
print(g.max())

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [26]:
print(g.mean())

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [27]:
print(g.describe())

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

# concatenate Data Frames

In [34]:
import pandas as pd
india_weather = pd.DataFrame(
    {
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
    }
)

india_weather["Country"] = "IND"

india_weather

       city  temperature  humidity Country
0    mumbai           32        80     IND
1     delhi           45        60     IND
2  banglore           30        78     IND

In [35]:
us_weather = pd.DataFrame(
    {
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
    }
)
us_weather["Country"] = "US"

us_weather

       city  temperature  humidity Country
0  new york           21        68      US
1   chicago           14        65      US
2   orlando           35        75      US

In [38]:
#concate two dataframes
df = pd.concat([india_weather, us_weather]).reset_index(drop=True)
df

       city  temperature  humidity Country
0    mumbai           32        80     IND
1     delhi           45        60     IND
2  banglore           30        78     IND
3  new york           21        68      US
4   chicago           14        65      US
5   orlando           35        75      US

In [39]:
#if you want continuous index
df = pd.concat([india_weather, us_weather], ignore_index=True)
df

       city  temperature  humidity Country
0    mumbai           32        80     IND
1     delhi           45        60     IND
2  banglore           30        78     IND
3  new york           21        68      US
4   chicago           14        65      US
5   orlando           35        75      US

In [40]:
df = pd.concat([india_weather, us_weather],axis=1)
df

,city,temperature,humidity,Country,city,temperature,humidity,Country
0,mumbai,32,80,IND,new york,21,68,US
1,delhi,45,60,IND,chicago,14,65,US
2,banglore,30,78,IND,orlando,35,75,US

# Merge DataFrames

In [41]:
temperature_df = pd.DataFrame(
    {
    "city": ["mumbai","delhi","banglore", 'hyderabad'],
    "temperature": [32,45,30,40]}
)
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2   banglore           30
3  hyderabad           40

In [42]:
humidity_df = pd.DataFrame({
    "city": ["delhi","mumbai","banglore"],
    "humidity": [68, 65, 75]})
humidity_df

       city  humidity
0     delhi        68
1    mumbai        65
2  banglore        75

In [50]:
#merge two dataframes with out explicitly mention index
df = pd.merge(temperature_df, humidity_df, on='city',how="inner")
df

       city  temperature  humidity
0     delhi           45        68
1    mumbai           32        65
2  banglore           30        75

In [51]:
#OUTER-JOIN
df = pd.merge(temperature_df, humidity_df, on='city', how='outer')
df

        city  temperature  humidity
0     mumbai           32      65.0
1      delhi           45      68.0
2   banglore           30      75.0
3  hyderabad           40       NaN

# Numerical Indexing (.loc vs iloc)

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.DataFrame([1,2,3,4,5,6,7,8,9,19], index=[49,48,47,46,45, 1, 2, 3, 4, 5])
df

In [ ]:
s.loc[:2]

In [ ]:
s.iloc[:2]

In [ ]:
s.loc[45]

In [ ]:
s.iloc[45]